* Optimize map by adding a chain-counter into each cell.
The chain-counter stores the number of bucket-lists going through it, so we do
not have to traverse the whole array searching for an element. This optimization
should also be compatible with the one Martin is implementing.
** optimize single map (actual implementation)
   :LOGBOOK:
   CLOCK: [2016-11-01 Die 13:06]--[2016-11-01 Die 13:07] =>  0:01
   CLOCK: [2016-11-01 Die 11:38]--[2016-11-01 Die 11:44] =>  0:06
   CLOCK: [2016-10-31 Mon 12:17]--[2016-10-31 Mon 12:32] =>  0:15
   :END:
*** Adjust single map contracts to allow a faster implementation.
    :LOGBOOK:
    CLOCK: [2016-11-01 Die 13:06]--[2016-11-01 Die 13:06] =>  0:00
    CLOCK: [2016-11-01 Die 11:44]--[2016-11-01 Die 11:46] =>  0:02
    CLOCK: [2016-11-01 Die 11:24]--[2016-11-01 Die 11:38] =>  0:14
    :END:
** adjust the double map (add additional array)
   :LOGBOOK:
   CLOCK: [2016-11-01 Die 11:46]--[2016-11-01 Die 11:54] =>  0:08
   :END:
** certify the single map optimization
   :LOGBOOK:
   CLOCK: [2016-11-27 Son 11:34]--[2016-11-27 Son 11:41] =>  0:07
   CLOCK: [2016-11-27 Son 11:27]--[2016-11-27 Son 11:27] =>  0:00
   CLOCK: [2016-11-27 Son 11:19]--[2016-11-27 Son 11:26] =>  0:07
   CLOCK: [2016-11-26 Sam 21:26]--[2016-11-26 Sam 21:47] =>  0:21
   CLOCK: [2016-11-26 Sam 20:24]--[2016-11-26 Sam 20:39] =>  0:15
   CLOCK: [2016-11-26 Sam 20:12]--[2016-11-26 Sam 20:23] =>  0:11
   CLOCK: [2016-11-26 Sam 19:33]--[2016-11-26 Sam 19:54] =>  0:21
   CLOCK: [2016-11-26 Sam 19:16]--[2016-11-26 Sam 19:32] =>  0:16
   CLOCK: [2016-11-26 Sam 11:41]--[2016-11-26 Sam 11:45] =>  0:04
   CLOCK: [2016-11-25 Fre 15:12]--[2016-11-25 Fre 15:29] =>  0:17
   CLOCK: [2016-11-25 Fre 14:50]--[2016-11-25 Fre 15:05] =>  0:15
   CLOCK: [2016-11-25 Fre 14:31]--[2016-11-25 Fre 14:45] =>  0:14
   CLOCK: [2016-11-25 Fre 14:09]--[2016-11-25 Fre 14:17] =>  0:08
   CLOCK: [2016-11-25 Fre 13:09]--[2016-11-25 Fre 13:45] =>  0:36
   CLOCK: [2016-11-24 Don 18:45]--[2016-11-24 Don 19:10] =>  0:25
   CLOCK: [2016-11-24 Don 17:42]--[2016-11-24 Don 18:26] =>  0:44
   CLOCK: [2016-11-24 Don 17:13]--[2016-11-24 Don 17:36] =>  0:23
   CLOCK: [2016-11-24 Don 14:59]--[2016-11-24 Don 15:33] =>  0:34
   CLOCK: [2016-11-24 Don 13:19]--[2016-11-24 Don 13:53] =>  0:34
   CLOCK: [2016-11-24 Don 12:20]--[2016-11-24 Don 13:06] =>  0:46
   CLOCK: [2016-11-24 Don 12:11]--[2016-11-24 Don 12:17] =>  0:06
   CLOCK: [2016-11-24 Don 10:03]--[2016-11-24 Don 11:38] =>  1:35
   CLOCK: [2016-11-24 Don 09:36]--[2016-11-24 Don 09:46] =>  0:10
   CLOCK: [2016-11-24 Don 08:53]--[2016-11-24 Don 09:07] =>  0:14
   CLOCK: [2016-11-23 Mit 22:09]--[2016-11-23 Mit 22:15] =>  0:06
   CLOCK: [2016-11-23 Mit 21:35]--[2016-11-23 Mit 21:51] =>  0:16
   CLOCK: [2016-11-23 Mit 16:26]--[2016-11-23 Mit 16:42] =>  0:16
   CLOCK: [2016-11-23 Mit 15:23]--[2016-11-23 Mit 15:34] =>  0:11
   CLOCK: [2016-11-23 Mit 11:59]--[2016-11-23 Mit 12:06] =>  0:07
   CLOCK: [2016-11-22 Die 18:10]--[2016-11-22 Die 18:11] =>  0:01
   CLOCK: [2016-11-22 Die 18:09]--[2016-11-22 Die 18:10] =>  0:01
   CLOCK: [2016-11-22 Die 17:53]--[2016-11-22 Die 18:05] =>  0:12
   CLOCK: [2016-11-22 Die 14:34]--[2016-11-22 Die 15:05] =>  0:31
   CLOCK: [2016-11-22 Die 11:36]--[2016-11-22 Die 11:51] =>  0:15
   CLOCK: [2016-11-21 Mon 13:33]--[2016-11-21 Mon 13:41] =>  0:08
   CLOCK: [2016-11-21 Mon 12:59]--[2016-11-21 Mon 13:13] =>  0:14
   CLOCK: [2016-11-19 Sam 15:19]--[2016-11-19 Sam 15:41] =>  0:22
   CLOCK: [2016-11-19 Sam 15:08]--[2016-11-19 Sam 15:09] =>  0:01
   CLOCK: [2016-11-18 Fre 14:33]--[2016-11-18 Fre 15:50] =>  1:17
   CLOCK: [2016-11-17 Don 18:47]--[2016-11-17 Don 19:27] =>  0:40
   CLOCK: [2016-11-16 Mit 15:54]--[2016-11-16 Mit 16:23] =>  0:29
   CLOCK: [2016-11-16 Mit 14:29]--[2016-11-16 Mit 15:36] =>  1:07
   CLOCK: [2016-11-16 Mit 14:10]--[2016-11-16 Mit 14:16] =>  0:06
   CLOCK: [2016-11-16 Mit 13:35]--[2016-11-16 Mit 13:45] =>  0:10
   CLOCK: [2016-11-16 Mit 13:00]--[2016-11-16 Mit 13:12] =>  0:12
   CLOCK: [2016-11-16 Mit 12:20]--[2016-11-16 Mit 12:56] =>  0:36
   CLOCK: [2016-11-15 Die 21:18]--[2016-11-15 Die 22:22] =>  1:04
   CLOCK: [2016-11-15 Die 17:17]--[2016-11-15 Die 18:03] =>  0:46
   CLOCK: [2016-11-15 Die 14:40]--[2016-11-15 Die 15:27] =>  0:47
   CLOCK: [2016-11-15 Die 14:16]--[2016-11-15 Die 14:27] =>  0:11
   CLOCK: [2016-11-15 Die 13:52]--[2016-11-15 Die 14:04] =>  0:12
   CLOCK: [2016-11-13 Son 21:04]--[2016-11-13 Son 22:02] =>  0:58
   CLOCK: [2016-11-13 Son 20:13]--[2016-11-13 Son 20:19] =>  0:06
   CLOCK: [2016-11-13 Son 19:29]--[2016-11-13 Son 20:06] =>  0:37
   CLOCK: [2016-11-13 Son 19:14]--[2016-11-13 Son 19:25] =>  0:11
   CLOCK: [2016-11-13 Son 18:39]--[2016-11-13 Son 18:44] =>  0:05
   CLOCK: [2016-11-13 Son 18:17]--[2016-11-13 Son 18:35] =>  0:18
   CLOCK: [2016-11-13 Son 17:48]--[2016-11-13 Son 18:04] =>  0:16
   CLOCK: [2016-11-13 Son 15:58]--[2016-11-13 Son 16:28] =>  0:30
   CLOCK: [2016-11-13 Son 15:28]--[2016-11-13 Son 15:40] =>  0:12
   CLOCK: [2016-11-11 Fre 14:36]--[2016-11-11 Fre 14:44] =>  0:08
   CLOCK: [2016-11-11 Fre 14:24]--[2016-11-11 Fre 14:33] =>  0:09
   CLOCK: [2016-11-11 Fre 12:33]--[2016-11-11 Fre 13:00] =>  0:27
   CLOCK: [2016-11-11 Fre 10:35]--[2016-11-11 Fre 10:36] =>  0:01
   CLOCK: [2016-11-10 Don 22:20]--[2016-11-10 Don 22:37] =>  0:17
   CLOCK: [2016-11-10 Don 20:11]--[2016-11-10 Don 21:34] =>  1:23
   CLOCK: [2016-11-10 Don 19:45]--[2016-11-10 Don 19:58] =>  0:13
   CLOCK: [2016-11-10 Don 19:10]--[2016-11-10 Don 19:45] =>  0:35
   CLOCK: [2016-11-10 Don 18:47]--[2016-11-10 Don 19:08] =>  0:21
   CLOCK: [2016-11-10 Don 17:25]--[2016-11-10 Don 17:58] =>  0:33
   CLOCK: [2016-11-10 Don 16:33]--[2016-11-10 Don 17:12] =>  0:39
   CLOCK: [2016-11-10 Don 16:26]--[2016-11-10 Don 16:30] =>  0:04
   CLOCK: [2016-11-10 Don 16:06]--[2016-11-10 Don 16:08] =>  0:02
   CLOCK: [2016-11-10 Don 15:18]--[2016-11-10 Don 15:46] =>  0:28
   CLOCK: [2016-11-10 Don 15:10]--[2016-11-10 Don 15:12] =>  0:02
   CLOCK: [2016-11-10 Don 14:48]--[2016-11-10 Don 14:55] =>  0:07
   CLOCK: [2016-11-10 Don 13:52]--[2016-11-10 Don 14:35] =>  0:43
   CLOCK: [2016-11-10 Don 11:59]--[2016-11-10 Don 12:07] =>  0:08
   CLOCK: [2016-11-10 Don 11:52]--[2016-11-10 Don 11:57] =>  0:05
   CLOCK: [2016-11-10 Don 10:09]--[2016-11-10 Don 10:30] =>  0:21
   :END:
*** design the abstract logical model
    :LOGBOOK:
    CLOCK: [2016-11-23 Mit 11:51]--[2016-11-23 Mit 11:59] =>  0:08
    CLOCK: [2016-11-23 Mit 11:49]--[2016-11-23 Mit 11:51] =>  0:02
    CLOCK: [2016-11-08 Die 18:53]--[2016-11-08 Die 18:53] =>  0:00
    CLOCK: [2016-11-08 Die 18:37]--[2016-11-08 Die 18:52] =>  0:15
    CLOCK: [2016-11-08 Die 15:52]--[2016-11-08 Die 16:01] =>  0:09
    CLOCK: [2016-11-08 Die 15:42]--[2016-11-08 Die 15:47] =>  0:05
    CLOCK: [2016-11-08 Die 15:23]--[2016-11-08 Die 15:33] =>  0:10
    CLOCK: [2016-11-08 Die 12:40]--[2016-11-08 Die 12:45] =>  0:05
    CLOCK: [2016-11-08 Die 12:37]--[2016-11-08 Die 12:38] =>  0:01
    CLOCK: [2016-11-08 Die 12:22]--[2016-11-08 Die 12:36] =>  0:14
    CLOCK: [2016-11-08 Die 11:37]--[2016-11-08 Die 11:43] =>  0:06
    CLOCK: [2016-11-08 Die 10:51]--[2016-11-08 Die 10:53] =>  0:02
    CLOCK: [2016-11-08 Die 10:05]--[2016-11-08 Die 10:11] =>  0:06
    CLOCK: [2016-11-01 Die 15:41]--[2016-11-01 Die 15:56] =>  0:15
    CLOCK: [2016-11-01 Die 15:14]--[2016-11-01 Die 15:38] =>  0:24
    CLOCK: [2016-11-01 Die 15:07]--[2016-11-01 Die 15:09] =>  0:02
    CLOCK: [2016-11-01 Die 13:23]--[2016-11-01 Die 13:35] =>  0:12
    CLOCK: [2016-11-01 Die 13:07]--[2016-11-01 Die 13:08] =>  0:01
    :END:
** certify the double map modifications
